package com.javarush.task.task07.task0724;

/* 
Семейная перепись
Создай класс Human с полями имя(String), пол(boolean), возраст(int), отец(Human), мать(Human).
Создай объекты и заполни их так, чтобы получилось: Два дедушки, две бабушки, отец, мать, трое детей.
Вывести объекты на экран.

Примечание:
Если написать свой метод String toString() в классе Human, то именно он будет использоваться при выводе объекта на экран.

Пример вывода:
Имя: Аня, пол: женский, возраст: 21, отец: Павел, мать: Катя
Имя: Катя, пол: женский, возраст: 55
Имя: Игорь, пол: мужской, возраст: 2, отец: Михаил, мать: Аня
...

Требования:
1. Программа не должна считывать данные с клавиатуры.
2. Добавить в класс Human поля: имя(String), пол(boolean), возраст(int), отец(Human), мать(Human).
3. Добавить в класс конструктор public Human(String name, boolean sex, int age).
4. Добавить в класс конструктор public Human(String name, boolean sex, int age, Human father, Human mother).
5. Создай 9 разных объектов типа Human (4 объекта без отца и матери и 5 объектов с ними)).
6. Выведи созданные объекты на экран.
*/

public class Solution {
    public static void main(String[] args) {
        Human valentina = new Human("Валентина", false, 90);
        Human vasya = new Human("Василий", true, 96);
        Human tanya = new Human("Татьяна", false, 96);
        Human kolya = new Human("Николай", true, 100);
        Human lena = new Human("Елена", false, 61, vasya, valentina);
        Human kostya = new Human("Константин", true, 66, kolya, tanya);
        Human marina = new Human("Марина", false, 41, kostya, lena);
        Human maksim = new Human("Максим", true, 38, kostya, lena);
        Human fedya = new Human("Федор", true, 39, kostya, lena);
        System.out.println(kostya.toString());
        System.out.println(kolya.toString());
        System.out.println(tanya.toString());
        System.out.println(lena.toString());
        System.out.println(vasya.toString());
        System.out.println(valentina.toString());
        System.out.println(marina.toString());
        System.out.println(maksim.toString());
        System.out.println(fedya.toString());
    }

    public static class Human {
        String name;
        boolean sex;
        int age;
        Human father;
        Human mother;

        public Human(String name, boolean sex, int age) {
            this.name = name;
            this.sex = sex;
            this.age = age;
        }

        public Human(String name, boolean sex, int age, Human father, Human mother) {
            this.name = name;
            this.sex = sex;
            this.age = age;
            this.father = father;
            this.mother = mother;
        }

        public String toString() {
            String text = "";
            text += "Имя: " + this.name;
            text += ", пол: " + (this.sex ? "мужской" : "женский");
            text += ", возраст: " + this.age;

            if (this.father != null)
                text += ", отец: " + this.father.name;

            if (this.mother != null)
                text += ", мать: " + this.mother.name;

            return text;
        }
    }
}
